org-tangle.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-26 Mon 21:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>tangling with org</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">tangling with org</h1>
<p>
tangle is a system for creating source files from org babel (literate
programming)'s src blocks
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. shortcuts</a></li>
<li><a href="#org0000001">2. tangling</a></li>
<li><a href="#org0000002">3. detangling</a>
<ul>
<li><a href="#org0000003">3.1. comments</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> shortcuts</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">shortcut</th>
<th scope="col" class="org-left">what it does</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-c C-c</code></td>
<td class="org-left">(in a src block) execute it</td>
</tr>

<tr>
<td class="org-left"><code>C-c '</code></td>
<td class="org-left">open src block in a new buffer</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-v t</code></td>
<td class="org-left">tangle</td>
</tr>

<tr>
<td class="org-left"><code>M-x o-j RET RET</code></td>
<td class="org-left">jump from tangled block back to source org</td>
</tr>

<tr>
<td class="org-left"><code>M-x o-det RET RET</code></td>
<td class="org-left">detangle tangled block</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0000001" class="outline-2">
<h2 id="org0000001"><span class="section-number-2">2.</span> tangling</h2>
<div class="outline-text-2" id="text-2">
<p>
src blocks with a <code>:tangle filename</code> will get tangled
</p>
</div>
</div>

<div id="outline-container-org0000002" class="outline-2">
<h2 id="org0000002"><span class="section-number-2">3.</span> detangling</h2>
<div class="outline-text-2" id="text-3">
<p>
maybe untangling too?
</p>
</div>

<div id="outline-container-org0000003" class="outline-3">
<h3 id="org0000003"><span class="section-number-3">3.1.</span> comments</h3>
<div class="outline-text-3" id="text-3-1">
<p>
detangle requires comments be put into the source file to work. stick
<code>:comments link</code> to your <code>#+begin_src</code> line to enable these. to enable
them for all tangle blocks, use <code>#+PROPERTY</code>:
</p>

<pre class="example" id="org0000004">
#+PROPERTY: header-args :tangle yes :comments link
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
